package org.hewei.algorithm.dataStructure;
/**
 * 队列实现与使用
 * 现有名称为name_i且处理时间为time_i的n个任务顺序排成一列，CPU通过循环
 * 调度法逐一处理这些任务，每个任务最多处理q ms（这个时间称为时间片）。如果
 * q ms之后这个任务仍然未结束，那么该任务将被移动至队伍最末尾，CPU随即开始
 * 处理下一个任务。
 * 输入 输入形式如下。
 * n q
 * name_1 time_1
 * name_2 time_2
 * name_3 time_3
 * ...
 * name_n time_n
 * 第一行输入表述任务数的整数n与表示时间片的整数q，用一个空格隔开
 * 接下来n行输入各种任务的信息。字符串name_i与time_i用一个空格隔开。
 * 输出 按照任务完成的先后顺序输出各个任务名以及结束时间，任务名与
 * 对应结束时间用空格隔开，对每一个任务与结束时间占一行。
 * 限制
 * 1 <= n <= 100_000
 * 1 <= q <= 1000
 * 1 <= time_i <= 50_000
 * 1 <= 字符串name_i的长度 <= 10
 * 1 <= time_i的和 <= 1_000_000
 *
 * 输入示例
 * 5 100
 * p1 150
 * p2 80
 * p3 200
 * p4 350
 * p5 20
 * 输出示例
 * p2 180
 * p5 400
 * p1 450
 * p3 550
 * p4 800
 */
public class Queue {

}
